/* Написати програму перевірки знань історія архітектури. Програма повинна вивести запитання та три варіанта відповіді. Користувач повинен вибрати правильну відповідь і вписати її номер. Правильна відповідь: архітектор  Іісаківського собору Огюст Монферран */
#include <stdio.h>
#include <stdlib.h>

/* run this program using the console pauser or add your own getch, system("pause") or input loop */

int main(int argc, char *argv[]) {
	system("chcp 1251"); // Ввід українських букв
	int a; // задання змінної
	printf("Виберіть правильну відповідь\n Архітектор Ісаакіївського собору:\n1. Доменіко Трезіні\n2. Огюст Монферран\n3. Карл Россі"); // ввід тексту
	
	printf("\nВаша відповідь:"); // Ввід відповіді із клавіатури 
	scanf("%d", &a);
	
	if 
	(a==2) printf("Відповідь правильна"); //При написанні із клавіатури цифри 2, вивід: (Відповідь правильна) 
	else  
	printf("Ви помилились"); //При написанні із клавіатури всіх цифр окрім 2, вивід (Ви помилились) 
	

	getch(); 
	return 0;
}
